<h1>Chapter 7: Data cleaning and Preparation </h1>
<h2>    Section 1: Handling missing data </h2>

In [2]:
import pandas as pd
import numpy as np

In [5]:
float_data = pd.Series([1.2, -3.5, np.nan, 0])

In [6]:
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [8]:
float_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [9]:
string_data = pd.Series(["aardvark", np.nan, None, "avocado"])

In [10]:
string_data

0    aardvark
1         NaN
2        None
3     avocado
dtype: object

In [11]:
string_data.isna()

0    False
1     True
2     True
3    False
dtype: bool

In [12]:
float_data  = pd.Series([1, 2, None], dtype="float64")

In [13]:
float_data.isna()

0    False
1    False
2     True
dtype: bool

In [14]:
float_data.dropna()

0    1.0
1    2.0
dtype: float64

In [15]:
string_data.dropna()

0    aardvark
3     avocado
dtype: object

In [17]:
string_data.fillna("spam")

0    aardvark
1        spam
2        spam
3     avocado
dtype: object

<h3>Filtering Out Missing Data</h3>

In [20]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])

In [21]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

<body>The longer method below is equivalent to dropna</body>

In [23]:
data[data.notna()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [27]:
data = pd.DataFrame([[1., 6.5, 3.], [1, np.nan, np.nan], [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])

In [28]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [29]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [31]:
data.dropna(how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [33]:
data[4] = np.nan

In [34]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [35]:
data.dropna(how="all", axis="columns")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [48]:
df = pd.DataFrame(np.random.standard_normal((7,3)))

In [49]:
df.iloc[:4,1] = np.nan

In [50]:
df.iloc[:2, 2] = np.nan

In [51]:
df

          0         1         2
0  0.571197       NaN       NaN
1  1.098831       NaN       NaN
2  0.299256       NaN -0.824819
3 -0.805986       NaN -1.255910
4 -0.487372  0.196999  1.732120
5  0.805231  0.661831 -0.442608
6 -0.798914  0.953476 -0.354726

In [52]:
df.dropna()

          0         1         2
4 -0.487372  0.196999  1.732120
5  0.805231  0.661831 -0.442608
6 -0.798914  0.953476 -0.354726

In [53]:
df.dropna(thresh=2)

          0         1         2
2  0.299256       NaN -0.824819
3 -0.805986       NaN -1.255910
4 -0.487372  0.196999  1.732120
5  0.805231  0.661831 -0.442608
6 -0.798914  0.953476 -0.354726

<h3>Filling In Missing Data</h3>

In [54]:
df.fillna(0)

          0         1         2
0  0.571197  0.000000  0.000000
1  1.098831  0.000000  0.000000
2  0.299256  0.000000 -0.824819
3 -0.805986  0.000000 -1.255910
4 -0.487372  0.196999  1.732120
5  0.805231  0.661831 -0.442608
6 -0.798914  0.953476 -0.354726

In [55]:
df.fillna({1:0.5, 2:0})

          0         1         2
0  0.571197  0.500000  0.000000
1  1.098831  0.500000  0.000000
2  0.299256  0.500000 -0.824819
3 -0.805986  0.500000 -1.255910
4 -0.487372  0.196999  1.732120
5  0.805231  0.661831 -0.442608
6 -0.798914  0.953476 -0.354726

In [57]:
df = pd.DataFrame(np.random.standard_normal((6, 3)))

In [58]:
df

          0         1         2
0  0.492486 -0.328257  0.241131
1 -0.766728  1.781390  0.741954
2  0.261512 -0.037581 -1.488723
3  0.841982 -0.526704  1.313149
4 -0.307059  1.309551 -0.473944
5  0.217035  0.921209 -1.104511

In [60]:
df.iloc[2:, 1] = np.nan

In [61]:
df.iloc[4:,2] = np.nan

In [62]:
df.fillna(method="ffill")

/tmp/ipykernel_17167/3944122520.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill")

          0         1         2
0  0.492486 -0.328257  0.241131
1 -0.766728  1.781390  0.741954
2  0.261512  1.781390 -1.488723
3  0.841982  1.781390  1.313149
4 -0.307059  1.781390  1.313149
5  0.217035  1.781390  1.313149

In [63]:
df.ffill()

          0         1         2
0  0.492486 -0.328257  0.241131
1 -0.766728  1.781390  0.741954
2  0.261512  1.781390 -1.488723
3  0.841982  1.781390  1.313149
4 -0.307059  1.781390  1.313149
5  0.217035  1.781390  1.313149

In [66]:
df.ffill(limit=2)

          0         1         2
0  0.492486 -0.328257  0.241131
1 -0.766728  1.781390  0.741954
2  0.261512  1.781390 -1.488723
3  0.841982  1.781390  1.313149
4 -0.307059       NaN  1.313149
5  0.217035       NaN  1.313149

In [67]:
df

          0         1         2
0  0.492486 -0.328257  0.241131
1 -0.766728  1.781390  0.741954
2  0.261512       NaN -1.488723
3  0.841982       NaN  1.313149
4 -0.307059       NaN       NaN
5  0.217035       NaN       NaN

In [68]:
data = pd.Series([1., np.nan, 3.5, np.nan, 7])

In [69]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [70]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

<h2>7.2 Data Transformation</h2>

<h3>Removing Duplicates</h3>

In [72]:
data = pd.DataFrame({"k1": ["one", "two"] * 3 + ["two"], "k2":[1, 1, 2, 3, 3, 4, 4]})

In [73]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [74]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [75]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [76]:
data["v1"] = range(7)

In [77]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [79]:
data.drop_duplicates(subset="k1")

    k1  k2  v1
0  one   1   0
1  two   1   1

In [80]:
data.drop_duplicates(subset=["k1", "k2"], keep="last")

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

<h3>Tranforming Data Using a Function or Mapping</h3>

In [3]:
data = pd.DataFrame({"food":["bacon", "pulled pork", "bacon",
                             "pastrami", "corned beef", "bacon", 
                             "pastrami", "honey ham", "nova lox"], 
                     "ounces":[4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [4]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [6]:
meat_to_animal =  {"bacon": "pig",
                   "pulled pork": "pig",
                   "pastrami": "cow",
                   "corned beef": "cow",
                   "honey ham": "pig",
                   "nova lox": "salmon",}

In [7]:
data["animal"] = data["food"].map(meat_to_animal)

In [8]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [9]:
def get_animal(x):
    return meat_to_animal[x]

In [10]:
data["food"].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

<h3 style="color:blue">Replacing Values</h3>

In [12]:
data = pd.Series([1., -999., 2., -999., -1000., 3.,])

In [13]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [14]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [16]:
data.replace([-999., -1000.], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [17]:
data.replace([-999., -1000.], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [18]:
data.replace({-999.: np.nan, -1000.: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

<h3 style="color:blue">Renaming Axis Indexes</h3>

In [22]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=["Ohio", "California", "New York"],
                    columns=["one", "two", "three", "four"])

In [23]:
data

            one  two  three  four
Ohio          0    1      2     3
California    4    5      6     7
New York      8    9     10    11

In [26]:
def transform(x):
    return x[:4].upper()

In [27]:
data.index.map(transform)

Index(['OHIO', 'CALI', 'NEW '], dtype='object')

In [29]:
data.index = data.index.map(transform)

In [30]:
data

      one  two  three  four
OHIO    0    1      2     3
CALI    4    5      6     7
NEW     8    9     10    11

In [31]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Cali    4    5      6     7
New     8    9     10    11

In [33]:
data.rename(index={"OHIO": "INDIANA", "CALI": "COLO"},
            columns={"three": "peekaboo"})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

<h3 style="color:blue">Discretizing and Binning</h3>

In [34]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [35]:
bins = [18, 25, 35, 60, 100]

In [36]:
age_categories = pd.cut(ages, bins)

In [37]:
age_categories

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [38]:
age_categories.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [39]:
age_categories.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [40]:
age_categories.categories[0]

Interval(18, 25, closed='right')

In [41]:
age_categories.value_counts()

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

In [42]:
pd.cut(ages, bins, right=False)

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64, left]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [43]:
group_names = ["Youth", "YoungAdult", "MiddleAged", "Senior"]

In [45]:
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [46]:
data = np.random.uniform(size=20)

In [50]:
quartiles = pd.cut(data, 4, precision=2)

In [51]:
quartiles

[(0.046, 0.27], (0.046, 0.27], (0.046, 0.27], (0.7, 0.92], (0.7, 0.92], ..., (0.7, 0.92], (0.49, 0.7], (0.49, 0.7], (0.27, 0.49], (0.7, 0.92]]
Length: 20
Categories (4, interval[float64, right]): [(0.046, 0.27] < (0.27, 0.49] < (0.49, 0.7] < (0.7, 0.92]]

In [52]:
quartiles.value_counts()

(0.046, 0.27]    6
(0.27, 0.49]     2
(0.49, 0.7]      3
(0.7, 0.92]      9
Name: count, dtype: int64

In [53]:
data = np.random.standard_normal(1_000)

In [54]:
quartiles =  pd.qcut(data, 4, precision=2)

In [55]:
quartiles

[(0.041, 0.68], (0.041, 0.68], (-3.42, -0.59], (-0.59, 0.041], (-3.42, -0.59], ..., (-0.59, 0.041], (0.68, 2.45], (0.68, 2.45], (0.68, 2.45], (0.041, 0.68]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.42, -0.59] < (-0.59, 0.041] < (0.041, 0.68] < (0.68, 2.45]]

In [56]:
quartiles.value_counts()

(-3.42, -0.59]    250
(-0.59, 0.041]    250
(0.041, 0.68]     250
(0.68, 2.45]      250
Name: count, dtype: int64

In [60]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.]).value_counts()

(-3.413, -1.192]    100
(-1.192, 0.0406]    400
(0.0406, 1.287]     400
(1.287, 2.449]      100
Name: count, dtype: int64

<h3 style="color:blue">Detecting and Filtering Outliers</h3>

In [61]:
data = pd.DataFrame(np.random.standard_normal((1000, 4)))

In [62]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.000876     0.034006     0.038114     0.036586
std       1.008893     1.004651     0.997548     1.029750
min      -2.802600    -3.170593    -3.600867    -3.811352
25%      -0.692908    -0.641832    -0.636313    -0.631271
50%      -0.049972     0.014903     0.034045     0.023912
75%       0.696408     0.689882     0.726052     0.735478
max       3.089404     2.969215     3.491024     3.017156

In [64]:
col=data[2]

In [65]:
col[col.abs() > 3]

80     3.491024
165    3.097696
923   -3.600867
Name: 2, dtype: float64

In [66]:
data[(data.abs() > 3).any(axis="columns")]

            0         1         2         3
77  -0.074459  2.239451  1.366940 -3.811352
80  -1.539755 -1.195651  3.491024 -0.385280
107  0.605199 -3.170593  0.877404  0.369067
165 -0.290402  1.899916  3.097696 -1.167844
184 -0.068707  1.396722 -0.688344 -3.102861
220  0.379314 -1.218912  0.862285 -3.225367
369  1.460510  0.060808  0.287572 -3.615449
695 -0.153199  1.498064 -0.025220  3.017156
721  3.005874 -0.479507  1.082321 -0.138316
733  3.089404 -0.501626 -0.396776 -1.042062
923  1.420017  1.972652 -3.600867 -0.494615
937 -0.877232 -3.072917  1.379104  0.192288

In [67]:
data[data.abs() > 3] = np.sign(data) * 3

In [69]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.000972     0.034249     0.038126     0.038324
std       1.008605     1.003897     0.993652     1.023968
min      -2.802600    -3.000000    -3.000000    -3.000000
25%      -0.692908    -0.641832    -0.636313    -0.631271
50%      -0.049972     0.014903     0.034045     0.023912
75%       0.696408     0.689882     0.726052     0.735478
max       3.000000     2.969215     3.000000     3.000000

In [70]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0  1.0  1.0
1 -1.0  1.0  1.0  1.0
2 -1.0 -1.0  1.0  1.0
3 -1.0 -1.0  1.0 -1.0
4  1.0  1.0 -1.0  1.0

<h3 style="color:blue">Permutations and Random Sampling</h3>

In [72]:
df = pd.DataFrame(np.arange(5 * 7).reshape((5, 7)))

In [73]:
df

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [76]:
sampler = np.random.permutation(5)

In [77]:
sampler

array([4, 0, 2, 3, 1])

In [78]:
df.take(sampler)

    0   1   2   3   4   5   6
4  28  29  30  31  32  33  34
0   0   1   2   3   4   5   6
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
1   7   8   9  10  11  12  13

In [79]:
df.iloc[sampler]

    0   1   2   3   4   5   6
4  28  29  30  31  32  33  34
0   0   1   2   3   4   5   6
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
1   7   8   9  10  11  12  13

In [80]:
column_sampler = np.random.permutation(7)

In [81]:
column_sampler

array([3, 5, 0, 2, 6, 1, 4])

In [92]:
df.take(column_sampler, axis="columns").take(sampler)

    3   5   0   2   6   1   4
4  31  33  28  30  34  29  32
0   3   5   0   2   6   1   4
2  17  19  14  16  20  15  18
3  24  26  21  23  27  22  25
1  10  12   7   9  13   8  11

In [93]:
df.sample(n=3)

    0   1   2   3   4   5   6
3  21  22  23  24  25  26  27
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20

In [94]:
choices = pd.Series([5, 7, -1, 6, 4])

In [95]:
choices.sample(n=10, replace=True)

0    5
4    4
3    6
1    7
2   -1
4    4
1    7
2   -1
0    5
2   -1
dtype: int64

<h3 style='color:blue'>Computing Indicator/Dummy Variables</h3>

In [100]:
df = pd.DataFrame({"key":["b", "b", "a", "c", "a", "b"],
              "data1":range(6)})

In [101]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [104]:
pd.get_dummies(df["key"], dtype=int )

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [105]:
dummies = pd.get_dummies(df["key"], prefix="key")

In [107]:
df_with_dummy = df[["data1"]].join(dummies)

In [108]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0  False   True  False
1      1  False   True  False
2      2   True  False  False
3      3  False  False   True
4      4   True  False  False
5      5  False   True  False

In [109]:
mnames= ["movi_id", "title",  "genre"]